{
    "note_events": 128,
    "wait_events": 125,
    "max_wait_time": 1000,
    "velocity_events": 128,
    "velocity_bins": 12,
    "velocity_exp": 0.5,
    "do_token_sorting": true,
    "unrolled_tokens": false,
    "decode_end_held_note_delay": 5.0,
    "decode_fix_repeated_notes": true,
    "bin_instrument_names": [
        "percussion",
        "drum",
        "tuba",
        "marimba",
        "bass",
        "guitar",
        "violin",
        "trumpet",
        "piano",
        "sax",
        "flute",
        "lead",
        "pad"
    ],
    "ch10_instrument_bin_name": "percussion",
    "program_name_to_bin_name": {
        "Acoustic Grand Piano": "piano",
        "Bright Acoustic Piano": "piano",
        "Electric Grand Piano": "piano",
        "Honky-tonk Piano": "piano",
        "Electric Piano 1 (Rhodes Piano)": "piano",
        "Electric Piano 2 (Chorused Piano)": "piano",
        "Harpsichord": "piano",
        "Clavinet": "piano",
        "Celesta": "marimba",
        "Glockenspiel": "marimba",
        "Music Box": "marimba",
        "Vibraphone": "marimba",
        "Marimba": "marimba",
        "Xylophone": "marimba",
        "Tubular Bells": "marimba",
        "Dulcimer (Santur)": "marimba",
        "Drawbar Organ (Hammond)": "marimba",
        "Percussive Organ": "piano",
        "Rock Organ": "piano",
        "Church Organ": "piano",
        "Reed Organ": "piano",
        "Accordion (French)": "piano",
        "Harmonica": "piano",
        "Tango Accordion (Band neon)": "piano",
        "Acoustic Guitar (nylon)": "guitar",
        "Acoustic Guitar (steel)": "guitar",
        "Electric Guitar (jazz)": "guitar",
        "Electric Guitar (clean)": "guitar",
        "Electric Guitar (muted)": "guitar",
        "Overdriven Guitar": "guitar",
        "Distortion Guitar": "guitar",
        "Guitar harmonics": "guitar",
        "Acoustic Bass": "bass",
        "Electric Bass (fingered)": "bass",
        "Electric Bass (picked)": "bass",
        "Fretless Bass": "bass",
        "Slap Bass 1": "bass",
        "Slap Bass 2": "bass",
        "Synth Bass 1": "bass",
        "Synth Bass 2": "bass",
        "Violin": "violin",
        "Viola": "violin",
        "Cello": "bass",
        "Contrabass": "bass",
        "Tremolo Strings": "violin",
        "Pizzicato Strings": "violin",
        "Orchestral Harp": "violin",
        "Timpani": "drum",
        "String Ensemble 1 (strings)": "violin",
        "String Ensemble 2 (slow strings)": "violin",
        "SynthStrings 1": "violin",
        "SynthStrings 2": "violin",
        "Choir Aahs": "violin",
        "Voice Oohs": "violin",
        "Synth Voice": "violin",
        "Orchestra Hit": "",
        "Trumpet": "trumpet",
        "Trombone": "tuba",
        "Tuba": "tuba",
        "Muted Trumpet": "trumpet",
        "French Horn": "trumpet",
        "Brass Section": "trumpet",
        "SynthBrass 1": "trumpet",
        "SynthBrass 2": "trumpet",
        "Soprano Sax": "sax",
        "Alto Sax": "sax",
        "Tenor Sax": "sax",
        "Baritone Sax": "sax",
        "Oboe": "sax",
        "English Horn": "trumpet",
        "Bassoon": "sax",
        "Clarinet": "sax",
        "Piccolo": "flute",
        "Flute": "flute",
        "Recorder": "flute",
        "Pan Flute": "flute",
        "Blown Bottle": "flute",
        "Shakuhachi": "flute",
        "Whistle": "flute",
        "Ocarina": "flute",
        "Lead 1 (square wave)": "lead",
        "Lead 2 (sawtooth wave)": "lead",
        "Lead 3 (calliope)": "lead",
        "Lead 4 (chiffer)": "lead",
        "Lead 5 (charang)": "lead",
        "Lead 6 (voice solo)": "violin",
        "Lead 7 (fifths)": "lead",
        "Lead 8 (bass + lead)": "lead",
        "Pad 1 (new age Fantasia)": "pad",
        "Pad 2 (warm)": "pad",
        "Pad 3 (polysynth)": "pad",
        "Pad 4 (choir space voice)": "violin",
        "Pad 5 (bowed glass)": "pad",
        "Pad 6 (metallic pro)": "pad",
        "Pad 7 (halo)": "pad",
        "Pad 8 (sweep)": "pad",
        "FX 1 (rain)": "",
        "FX 2 (soundtrack)": "",
        "FX 3 (crystal)": "",
        "FX 4 (atmosphere)": "",
        "FX 5 (brightness)": "",
        "FX 6 (goblins)": "",
        "FX 7 (echoes, drops)": "",
        "FX 8 (sci-fi, star theme)": "",
        "Sitar": "guitar",
        "Banjo": "guitar",
        "Shamisen": "guitar",
        "Koto": "guitar",
        "Kalimba": "guitar",
        "Bag pipe": "sax",
        "Fiddle": "violin",
        "Shanai": "sax",
        "Tinkle Bell": "marimba",
        "Agogo": "marimba",
        "Steel Drums": "marimba",
        "Woodblock": "marimba",
        "Taiko Drum": "drum",
        "Melodic Tom": "drum",
        "Synth Drum": "drum",
        "Reverse Cymbal": "",
        "Guitar Fret Noise": "",
        "Breath Noise": "",
        "Seashore": "",
        "Bird Tweet": "",
        "Telephone Ring": "",
        "Helicopter": "",
        "Applause": "",
        "Gunshot": ""
    },
    "bin_name_to_program_name": {
        "piano": "Acoustic Grand Piano",
        "marimba": "Marimba",
        "drum": "Synth Drum",
        "guitar": "Acoustic Guitar (steel)",
        "bass": "Acoustic Bass",
        "violin": "Violin",
        "percussion": "",
        "trumpet": "Trumpet",
        "tuba": "Tuba",
        "sax": "Tenor Sax",
        "flute": "Flute",
        "lead": "Lead 1 (square wave)",
        "pad": "Pad 1 (new age Fantasia)"
    },
    "instrument_names": {
        "0": "Acoustic Grand Piano",
        "1": "Bright Acoustic Piano",
        "2": "Electric Grand Piano",
        "3": "Honky-tonk Piano",
        "4": "Electric Piano 1 (Rhodes Piano)",
        "5": "Electric Piano 2 (Chorused Piano)",
        "6": "Harpsichord",
        "7": "Clavinet",
        "8": "Celesta",
        "9": "Glockenspiel",
        "10": "Music Box",
        "11": "Vibraphone",
        "12": "Marimba",
        "13": "Xylophone",
        "14": "Tubular Bells",
        "15": "Dulcimer (Santur)",
        "16": "Drawbar Organ (Hammond)",
        "17": "Percussive Organ",
        "18": "Rock Organ",
        "19": "Church Organ",
        "20": "Reed Organ",
        "21": "Accordion (French)",
        "22": "Harmonica",
        "23": "Tango Accordion (Band neon)",
        "24": "Acoustic Guitar (nylon)",
        "25": "Acoustic Guitar (steel)",
        "26": "Electric Guitar (jazz)",
        "27": "Electric Guitar (clean)",
        "28": "Electric Guitar (muted)",
        "29": "Overdriven Guitar",
        "30": "Distortion Guitar",
        "31": "Guitar harmonics",
        "32": "Acoustic Bass",
        "33": "Electric Bass (fingered)",
        "34": "Electric Bass (picked)",
        "35": "Fretless Bass",
        "36": "Slap Bass 1",
        "37": "Slap Bass 2",
        "38": "Synth Bass 1",
        "39": "Synth Bass 2",
        "40": "Violin",
        "41": "Viola",
        "42": "Cello",
        "43": "Contrabass",
        "44": "Tremolo Strings",
        "45": "Pizzicato Strings",
        "46": "Orchestral Harp",
        "47": "Timpani",
        "48": "String Ensemble 1 (strings)",
        "49": "String Ensemble 2 (slow strings)",
        "50": "SynthStrings 1",
        "51": "SynthStrings 2",
        "52": "Choir Aahs",
        "53": "Voice Oohs",
        "54": "Synth Voice",
        "55": "Orchestra Hit",
        "56": "Trumpet",
        "57": "Trombone",
        "58": "Tuba",
        "59": "Muted Trumpet",
        "60": "French Horn",
        "61": "Brass Section",
        "62": "SynthBrass 1",
        "63": "SynthBrass 2",
        "64": "Soprano Sax",
        "65": "Alto Sax",
        "66": "Tenor Sax",
        "67": "Baritone Sax",
        "68": "Oboe",
        "69": "English Horn",
        "70": "Bassoon",
        "71": "Clarinet",
        "72": "Piccolo",
        "73": "Flute",
        "74": "Recorder",
        "75": "Pan Flute",
        "76": "Blown Bottle",
        "77": "Shakuhachi",
        "78": "Whistle",
        "79": "Ocarina",
        "80": "Lead 1 (square wave)",
        "81": "Lead 2 (sawtooth wave)",
        "82": "Lead 3 (calliope)",
        "83": "Lead 4 (chiffer)",
        "84": "Lead 5 (charang)",
        "85": "Lead 6 (voice solo)",
        "86": "Lead 7 (fifths)",
        "87": "Lead 8 (bass + lead)",
        "88": "Pad 1 (new age Fantasia)",
        "89": "Pad 2 (warm)",
        "90": "Pad 3 (polysynth)",
        "91": "Pad 4 (choir space voice)",
        "92": "Pad 5 (bowed glass)",
        "93": "Pad 6 (metallic pro)",
        "94": "Pad 7 (halo)",
        "95": "Pad 8 (sweep)",
        "96": "FX 1 (rain)",
        "97": "FX 2 (soundtrack)",
        "98": "FX 3 (crystal)",
        "99": "FX 4 (atmosphere)",
        "100": "FX 5 (brightness)",
        "101": "FX 6 (goblins)",
        "102": "FX 7 (echoes, drops)",
        "103": "FX 8 (sci-fi, star theme)",
        "104": "Sitar",
        "105": "Banjo",
        "106": "Shamisen",
        "107": "Koto",
        "108": "Kalimba",
        "109": "Bag pipe",
        "110": "Fiddle",
        "111": "Shanai",
        "112": "Tinkle Bell",
        "113": "Agogo",
        "114": "Steel Drums",
        "115": "Woodblock",
        "116": "Taiko Drum",
        "117": "Melodic Tom",
        "118": "Synth Drum",
        "119": "Reverse Cymbal",
        "120": "Guitar Fret Noise",
        "121": "Breath Noise",
        "122": "Seashore",
        "123": "Bird Tweet",
        "124": "Telephone Ring",
        "125": "Helicopter",
        "126": "Applause",
        "127": "Gunshot"
    }
}